---
kind: property
id: P:Autodesk.Revit.UI.IFCExternalServiceUIData.IsReset
source: html/7207d706-bbe3-ca60-5a94-602b05635b5e.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData.IsReset Property

flag to indicate the value has been reset

## Syntax (C#)
```csharp
public bool IsReset { get; set; }
```